Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_flash_sec_type.h
#ifndef _RTL8735B_FLASH_SEC_TYPE_H_
#define _RTL8735B_FLASH_SEC_TYPE_H_

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_STS_REG
 * @brief  Flash SEC Engine Status Register          (@ 0X000)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REMAP_ADDR_ERR               7
#define FLASH_SEC_BIT_REMAP_ADDR_ERR                 ((u32)0x00000001 << 7)                              /*!<R 0  Indicate the flash address after adding offset size cross 256 Mbytes boundaries. */
#define FLASH_SEC_SHIFT_REMAP_REGN_ERR               6
#define FLASH_SEC_BIT_REMAP_REGN_ERR                 ((u32)0x00000001 << 6)                              /*!<R 0  Indicate the flash read address hits multiple remmaping region. */
#define FLASH_SEC_SHIFT_INTR_ERR_INIT                5
#define FLASH_SEC_BIT_INTR_ERR_INIT                  ((u32)0x00000001 << 5)                              /*!<R 0  Indicate the transaction was received before the key initialization is completed. */
#define FLASH_SEC_SHIFT_INTR_ERR_APB                 4
#define FLASH_SEC_BIT_INTR_ERR_APB                   ((u32)0x00000001 << 4)                              /*!<R 0  Indicate whether the setting configuration failed. When a transaction is in progress, all settings except clear interrupt are invalid. */
#define FLASH_SEC_SHIFT_INTR_ERR_RESP                3
#define FLASH_SEC_BIT_INTR_ERR_RESP                  ((u32)0x00000001 << 3)                              /*!<R 0  Indicate a error response is received from slave. */
#define FLASH_SEC_SHIFT_INTR_ERR_TAG                 2
#define FLASH_SEC_BIT_INTR_ERR_TAG                   ((u32)0x00000001 << 2)                              /*!<R 0  Indicate a GCM tag mismatch error occurred. */
#define FLASH_SEC_SHIFT_KEY_INIT_DONE                1
#define FLASH_SEC_BIT_KEY_INIT_DONE                  ((u32)0x00000001 << 1)                              /*!<R 0  Indicates whether the initialization of the key is completed. Only used in AES GCM and ECB_MIX mode. */
#define FLASH_SEC_SHIFT_IDLE                         0
#define FLASH_SEC_BIT_IDLE                           ((u32)0x00000001 << 0)                              /*!<R 1  Indicates whether there is any outstanding transaction. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CID_REG
 * @brief  Flash SEC Engine Component Identification Register (@ 0X004)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_LINE_SIZE                    12
#define FLASH_SEC_MASK_LINE_SIZE                     ((u32)0x00000007 << 12)                             /*!<R 0  Cache line size. Indicate how many 128 bits blocks are used to calculate the tag. 3'b000: 16 Bytes = 1 AES Block 3'b001: 32 Bytes = 2 AES Block 3'b010: 64 Bytes = 4 AES Block 3'b011: 128 Bytes = 8 AES Block */
#define FLASH_SEC_SHIFT_KEY_SRC                      11
#define FLASH_SEC_BIT_KEY_SRC                        ((u32)0x00000001 << 11)                             /*!<R 0  Indicate the key source. 1'b0: From dedicated key port(only support this configuration currently) */
#define FLASH_SEC_SHIFT_SPRT_GCM                     10
#define FLASH_SEC_BIT_SPRT_GCM                       ((u32)0x00000001 << 10)                             /*!<R 0  Indicate whether the AES GCM mode is supported. */
#define FLASH_SEC_SHIFT_SPRT_ECB_MIX                 9
#define FLASH_SEC_BIT_SPRT_ECB_MIX                   ((u32)0x00000001 << 9)                              /*!<R 0  Indicate whether the AES ECB MIX mode is supported. */
#define FLASH_SEC_SHIFT_SPRT_CTR                     8
#define FLASH_SEC_BIT_SPRT_CTR                       ((u32)0x00000001 << 8)                              /*!<R 0  Indicate whether the AES CTR mode is supported. */
#define FLASH_SEC_SHIFT_IV_NUMBER                    4
#define FLASH_SEC_MASK_IV_NUMBER                     ((u32)0x0000000F << 4)                              /*!<R 0  Number of supported IVs pattern registers. */
#define FLASH_SEC_SHIFT_REGN_NUMBER                  0
#define FLASH_SEC_MASK_REGN_NUMBER                   ((u32)0x0000000F << 0)                              /*!<R 0  Number of supported decryption regions. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_ERR_ADDR_REG
 * @brief  Flash SEC Engine Error Address Log Register (@ 0X008)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_ERR_ADDR                     0
#define FLASH_SEC_MASK_ERR_ADDR                      ((u32)0xFFFFFFFF << 0)                              /*!<R 0  Recorded flash address when AES GCM Tag mismatch error or receiving an error response. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CLR_INT_REG
 * @brief  Flash SEC Engine Clear Interrupt Register (@ 0X010)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_CLR_INTR                     0
#define FLASH_SEC_BIT_CLR_INTR                       ((u32)0x00000001 << 0)                              /*!<W 0  Interrupt clear control. It has to write 1'b1 to this register every time when the error exception occurs. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CTRL_REG
 * @brief  Flash SEC Engine Control Register         (@ 0X014)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_ICG_CTRL_4                   20
#define FLASH_SEC_BIT_ICG_CTRL_4                     ((u32)0x00000001 << 20)                             /*!<R/W 0  Disable key-reg auto clock gatting. */
#define FLASH_SEC_SHIFT_ICG_CTRL_3                   19
#define FLASH_SEC_BIT_ICG_CTRL_3                     ((u32)0x00000001 << 19)                             /*!<R/W 0  Disable apb-ctrl auto clock gatting. */
#define FLASH_SEC_SHIFT_ICG_CTRL_2                   18
#define FLASH_SEC_BIT_ICG_CTRL_2                     ((u32)0x00000001 << 18)                             /*!<R/W 0  Disable aes-engine auto clock gatting. */
#define FLASH_SEC_SHIFT_ICG_CTRL_1                   17
#define FLASH_SEC_BIT_ICG_CTRL_1                     ((u32)0x00000001 << 17)                             /*!<R/W 0  Disable fetch-unit auto clock gatting. */
#define FLASH_SEC_SHIFT_ICG_CTRL_0                   16
#define FLASH_SEC_BIT_ICG_CTRL_0                     ((u32)0x00000001 << 16)                             /*!<R/W 0  Disable line-buffer auto clock gatting. */
#define FLASH_SEC_SHIFT_AES_EN                       8
#define FLASH_SEC_BIT_AES_EN                         ((u32)0x00000001 << 8)                              /*!<R/W 0  Determine whether to enable the AES Engine. 1'b0: Disable decryption engine(except remapping function) 1'b1: Enable decryption engine and line buffer */
#define FLASH_SEC_SHIFT_KEY_SIZE                     5
#define FLASH_SEC_MASK_KEY_SIZE                      ((u32)0x00000003 << 5)                              /*!<R/W 0  Determine the size of AES Cipher key. 2'b00: 128 bits 2'b01: 192 bits 2'b10: 256 bits 2'b11: reserved */
#define FLASH_SEC_SHIFT_AXI_WORD_SWAP                4
#define FLASH_SEC_BIT_AXI_WORD_SWAP                  ((u32)0x00000001 << 4)                              /*!<R/W 0  Determine the endian of the ciphertext in slave memory. If set to 1'b1, can swap word order. */
#define FLASH_SEC_SHIFT_AXI_BYTE_SWAP                3
#define FLASH_SEC_BIT_AXI_BYTE_SWAP                  ((u32)0x00000001 << 3)                              /*!<R/W 0  Determine the endian of the ciphertext in slave memory. If set to 1'b1, can swap byte order. */
#define FLASH_SEC_SHIFT_TAG_SIZE                     0
#define FLASH_SEC_MASK_TAG_SIZE                      ((u32)0x00000003 << 0)                              /*!<R/W 0  AES GCM Tag size. The size of the AES GCM tag will affect the length of each tag command. 2'b00: 32 bits(4 bytes) 2'b01: 64 bits(8 bytes) 2'b10: 128 bits(16 bytes) 2'b11: reserved */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_MAINTAIN_OP_REG
 * @brief  Flash SEC Engine Maintenance Operation Register (@ 0X018)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_CLEAN_CACHE_LINE             2
#define FLASH_SEC_BIT_CLEAN_CACHE_LINE               ((u32)0x00000001 << 2)                              /*!<W 0  Manually clear the line buffer. Write 1'b1 to clear all after Flash data update. */
#define FLASH_SEC_SHIFT_DEC_KEY_INIT                 1
#define FLASH_SEC_BIT_DEC_KEY_INIT                   ((u32)0x00000001 << 1)                              /*!<W 0  Only used in ECB_MIX mode. Whenever the key is changed, write 1'b1 to initialize the decryption key. When keys are updated by external port, Flash SEC engine will trigger this bit automatically. The status of completion can be determined by reading bit 1 of the status register. */
#define FLASH_SEC_SHIFT_GCM_KEY_INIT                 0
#define FLASH_SEC_BIT_GCM_KEY_INIT                   ((u32)0x00000001 << 0)                              /*!<W 0  Only used in GCM mode. Whenever the key is changed, write 1'b1 to initialize the GMAC key. When keys are updated by external port, Flash SEC engine will trigger this bit automatically. The status of completion can be determined by reading bit 1 of the status register. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_LOCK_CTRL_REG
 * @brief  Flash SEC Engine Write Lock Control Register (@ 0X01C)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_SEC_LOCK_EN                  0
#define FLASH_SEC_MASK_SEC_LOCK_EN                   ((u32)0x000000FF << 0)                              /*!<R/W 0  When set 0xDC to this field, all registers excep #sec_clr_int_reg and #sec_maintain_op_reg are not allowed to be written. Once the lock is set, the way to unlock is reset the Flash SEC engine. If SW wants to modified the setting of control registers, it should keep this lock unset. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_GCM_TAG_BASE_REG
 * @brief  Flash SEC Engine AES GCM TAG Base Address Register (@ 0X020)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_TAG_BASE                     0
#define FLASH_SEC_MASK_TAG_BASE                      ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  AES GCM Encrypted Tag Flash base address for reference to the Flash SEC engine. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_REGION0_BASE_REG
 * @brief  Flash SEC Engine Cipher Region0 Base Address Register (@ 0X040)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REGN_0_BASE                  12
#define FLASH_SEC_MASK_REGN_0_BASE                   ((u32)0x000FFFFF << 12)                             /*!<R/W 0  Region 0_cipher base address. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_REGION0_END_REG
 * @brief  Flash SEC Engine Cipher Region0 End Address Register (@ 0X044)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REGN_0_END                   12
#define FLASH_SEC_MASK_REGN_0_END                    ((u32)0x000FFFFF << 12)                             /*!<R/W 0  Region 0 cipher end address. */
#define FLASH_SEC_SHIFT_REGN_0_IV_NUM                8
#define FLASH_SEC_MASK_REGN_0_IV_NUM                 ((u32)0x00000007 << 8)                              /*!<R/W 0  IV pattern used in region 0. Apply which IV pattern registers to this region.(Number corresponds to IV pattern registers) */
#define FLASH_SEC_SHIFT_REGN_0_MODE                  1
#define FLASH_SEC_MASK_REGN_0_MODE                   ((u32)0x00000003 << 1)                              /*!<R/W 0  Cipher Mode used in region 0. 2'b00: GCM mode 2'b01: CTR mode 2'b10: ECB_MIX mode 2'b11: Reserved */
#define FLASH_SEC_SHIFT_REGN_0_ENABLE                0
#define FLASH_SEC_BIT_REGN_0_ENABLE                  ((u32)0x00000001 << 0)                              /*!<R/W 0  Enable region 0 cipher setting. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_REGION1_BASE_REG
 * @brief  Flash SEC Engine Cipher Region1 Base Address Register (@ 0X048)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REGN_1_BASE                  12
#define FLASH_SEC_MASK_REGN_1_BASE                   ((u32)0x000FFFFF << 12)                             /*!<R/W 0  Region 1_cipher base address. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_REGION1_END_REG
 * @brief  Flash SEC Engine Cipher Region1 End Address Register (@ 0X04C)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REGN_1_END                   12
#define FLASH_SEC_MASK_REGN_1_END                    ((u32)0x000FFFFF << 12)                             /*!<R/W 0  Region 1 cipher end address. */
#define FLASH_SEC_SHIFT_REGN_1_IV_NUM                8
#define FLASH_SEC_MASK_REGN_1_IV_NUM                 ((u32)0x00000007 << 8)                              /*!<R/W 0  IV pattern used in region 1. Apply which IV pattern registers to this region.(Number corresponds to IV pattern registers) */
#define FLASH_SEC_SHIFT_REGN_1_MODE                  1
#define FLASH_SEC_MASK_REGN_1_MODE                   ((u32)0x00000003 << 1)                              /*!<R/W 0  Cipher Mode used in region 1. 2'b00: GCM mode 2'b01: CTR mode 2'b10: ECB_MIX mode 2'b11: Reserved */
#define FLASH_SEC_SHIFT_REGN_1_ENABLE                0
#define FLASH_SEC_BIT_REGN_1_ENABLE                  ((u32)0x00000001 << 0)                              /*!<R/W 0  Enable region 1 cipher setting. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_REGION2_BASE_REG
 * @brief  Flash SEC Engine Cipher Region2 Base Address Register (@ 0X050)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REGN_2_BASE                  12
#define FLASH_SEC_MASK_REGN_2_BASE                   ((u32)0x000FFFFF << 12)                             /*!<R/W 0  Region 2_cipher base address. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_REGION2_END_REG
 * @brief  Flash SEC Engine Cipher Region2 End Address Register (@ 0X054)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REGN_2_END                   12
#define FLASH_SEC_MASK_REGN_2_END                    ((u32)0x000FFFFF << 12)                             /*!<R/W 0  Region 2 cipher end address. */
#define FLASH_SEC_SHIFT_REGN_2_IV_NUM                8
#define FLASH_SEC_MASK_REGN_2_IV_NUM                 ((u32)0x00000007 << 8)                              /*!<R/W 0  IV pattern used in region 2. Apply which IV pattern registers to this region.(Number corresponds to IV pattern registers) */
#define FLASH_SEC_SHIFT_REGN_2_MODE                  1
#define FLASH_SEC_MASK_REGN_2_MODE                   ((u32)0x00000003 << 1)                              /*!<R/W 0  Cipher Mode used in region 2. 2'b00: GCM mode 2'b01: CTR mode 2'b10: ECB_MIX mode 2'b11: Reserved */
#define FLASH_SEC_SHIFT_REGN_2_ENABLE                0
#define FLASH_SEC_BIT_REGN_2_ENABLE                  ((u32)0x00000001 << 0)                              /*!<R/W 0  Enable region 2 cipher setting. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_REGION3_BASE_REG
 * @brief  Flash SEC Engine Cipher Region3 Base Address Register (@ 0X058)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REGN_3_BASE                  12
#define FLASH_SEC_MASK_REGN_3_BASE                   ((u32)0x000FFFFF << 12)                             /*!<R/W 0  Region 3_cipher base address. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_REGION3_END_REG
 * @brief  Flash SEC Engine Cipher Region3 End Address Register (@ 0X05C)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REGN_3_END                   12
#define FLASH_SEC_MASK_REGN_3_END                    ((u32)0x000FFFFF << 12)                             /*!<R/W 0  Region 3 cipher end address. */
#define FLASH_SEC_SHIFT_REGN_3_IV_NUM                8
#define FLASH_SEC_MASK_REGN_3_IV_NUM                 ((u32)0x00000007 << 8)                              /*!<R/W 0  IV pattern used in region 3. Apply which IV pattern registers to this region.(Number corresponds to IV pattern registers) */
#define FLASH_SEC_SHIFT_REGN_3_MODE                  1
#define FLASH_SEC_MASK_REGN_3_MODE                   ((u32)0x00000003 << 1)                              /*!<R/W 0  Cipher Mode used in region 3. 2'b00: GCM mode 2'b01: CTR mode 2'b10: ECB_MIX mode 2'b11: Reserved */
#define FLASH_SEC_SHIFT_REGN_3_ENABLE                0
#define FLASH_SEC_BIT_REGN_3_ENABLE                  ((u32)0x00000001 << 0)                              /*!<R/W 0  Enable region 3 cipher setting. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_REGION4_BASE_REG
 * @brief  Flash SEC Engine Cipher Region4 Base Address Register (@ 0X060)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REGN_4_BASE                  12
#define FLASH_SEC_MASK_REGN_4_BASE                   ((u32)0x000FFFFF << 12)                             /*!<R/W 0  Region 4_cipher base address. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_REGION4_END_REG
 * @brief  Flash SEC Engine Cipher Region4 End Address Register (@ 0X064)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REGN_4_END                   12
#define FLASH_SEC_MASK_REGN_4_END                    ((u32)0x000FFFFF << 12)                             /*!<R/W 0  Region 4 cipher end address. */
#define FLASH_SEC_SHIFT_REGN_4_IV_NUM                8
#define FLASH_SEC_MASK_REGN_4_IV_NUM                 ((u32)0x00000007 << 8)                              /*!<R/W 0  IV pattern used in region 4. Apply which IV pattern registers to this region.(Number corresponds to IV pattern registers) */
#define FLASH_SEC_SHIFT_REGN_4_MODE                  1
#define FLASH_SEC_MASK_REGN_4_MODE                   ((u32)0x00000003 << 1)                              /*!<R/W 0  Cipher Mode used in region 4. 2'b00: GCM mode 2'b01: CTR mode 2'b10: ECB_MIX mode 2'b11: Reserved */
#define FLASH_SEC_SHIFT_REGN_4_ENABLE                0
#define FLASH_SEC_BIT_REGN_4_ENABLE                  ((u32)0x00000001 << 0)                              /*!<R/W 0  Enable region 4 cipher setting. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_REGION5_BASE_REG
 * @brief  Flash SEC Engine Cipher Region5 Base Address Register (@ 0X068)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REGN_5_BASE                  12
#define FLASH_SEC_MASK_REGN_5_BASE                   ((u32)0x000FFFFF << 12)                             /*!<R/W 0  Region 5_cipher base address. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_REGION5_END_REG
 * @brief  Flash SEC Engine Cipher Region5 End Address Register (@ 0X06C)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REGN_5_END                   12
#define FLASH_SEC_MASK_REGN_5_END                    ((u32)0x000FFFFF << 12)                             /*!<R/W 0  Region 5 cipher end address. */
#define FLASH_SEC_SHIFT_REGN_5_IV_NUM                8
#define FLASH_SEC_MASK_REGN_5_IV_NUM                 ((u32)0x00000007 << 8)                              /*!<R/W 0  IV pattern used in region 5. Apply which IV pattern registers to this region.(Number corresponds to IV pattern registers) */
#define FLASH_SEC_SHIFT_REGN_5_MODE                  1
#define FLASH_SEC_MASK_REGN_5_MODE                   ((u32)0x00000003 << 1)                              /*!<R/W 0  Cipher Mode used in region 5. 2'b00: GCM mode 2'b01: CTR mode 2'b10: ECB_MIX mode 2'b11: Reserved */
#define FLASH_SEC_SHIFT_REGN_5_ENABLE                0
#define FLASH_SEC_BIT_REGN_5_ENABLE                  ((u32)0x00000001 << 0)                              /*!<R/W 0  Enable region 5 cipher setting. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_REGION6_BASE_REG
 * @brief  Flash SEC Engine Cipher Region6 Base Address Register (@ 0X070)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REGN_6_BASE                  12
#define FLASH_SEC_MASK_REGN_6_BASE                   ((u32)0x000FFFFF << 12)                             /*!<R/W 0  Region 6_cipher base address. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_REGION6_END_REG
 * @brief  Flash SEC Engine Cipher Region6 End Address Register (@ 0X074)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REGN_6_END                   12
#define FLASH_SEC_MASK_REGN_6_END                    ((u32)0x000FFFFF << 12)                             /*!<R/W 0  Region 6 cipher end address. */
#define FLASH_SEC_SHIFT_REGN_6_IV_NUM                8
#define FLASH_SEC_MASK_REGN_6_IV_NUM                 ((u32)0x00000007 << 8)                              /*!<R/W 0  IV pattern used in region 6. Apply which IV pattern registers to this region.(Number corresponds to IV pattern registers) */
#define FLASH_SEC_SHIFT_REGN_6_MODE                  1
#define FLASH_SEC_MASK_REGN_6_MODE                   ((u32)0x00000003 << 1)                              /*!<R/W 0  Cipher Mode used in region 6. 2'b00: GCM mode 2'b01: CTR mode 2'b10: ECB_MIX mode 2'b11: Reserved */
#define FLASH_SEC_SHIFT_REGN_6_ENABLE                0
#define FLASH_SEC_BIT_REGN_6_ENABLE                  ((u32)0x00000001 << 0)                              /*!<R/W 0  Enable region 6 cipher setting. */
/** @} */

