Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_flash_sec_type.h
/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_REGION7_BASE_REG
 * @brief  Flash SEC Engine Cipher Region7 Base Address Register (@ 0X078)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REGN_7_BASE                  12
#define FLASH_SEC_MASK_REGN_7_BASE                   ((u32)0x000FFFFF << 12)                             /*!<R/W 0  Region 7 cipher base address. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_REGION7_END_REG
 * @brief  Flash SEC Engine Cipher Region7 End Address Register (@ 0X07C)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REGN_7_END                   12
#define FLASH_SEC_MASK_REGN_7_END                    ((u32)0x000FFFFF << 12)                             /*!<R/W 0  Region 7 cipher end address. */
#define FLASH_SEC_SHIFT_REGN_7_IV_NUM                8
#define FLASH_SEC_MASK_REGN_7_IV_NUM                 ((u32)0x00000007 << 8)                              /*!<R/W 0  IV pattern used in region 7. Apply which IV pattern registers to this region.(Number corresponds to IV pattern registers) */
#define FLASH_SEC_SHIFT_REGN_7_MODE                  1
#define FLASH_SEC_MASK_REGN_7_MODE                   ((u32)0x00000003 << 1)                              /*!<R/W 0  Cipher Mode used in region 7. 2'b00: GCM mode 2'b01: CTR mode 2'b10: ECB_MIX mode 2'b11: Reserved */
#define FLASH_SEC_SHIFT_REGN_7_ENABLE                0
#define FLASH_SEC_BIT_REGN_7_ENABLE                  ((u32)0x00000001 << 0)                              /*!<R/W 0  Enable region 7 cipher setting. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_IV0_LOW_REG
 * @brief  Flash SEC Engine Cipher IV0 Low Pattern Register (@ 0X080)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_IV_0_LOW                     0
#define FLASH_SEC_MASK_IV_0_LOW                      ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  IV 0 Low Pattern value. IV is 16 bytes = iv_0_high(32) + iv_0_low(32) + flash_addr(32) + flash_addr_cnt(32) IV is 12 bytes = iv_0_high(32) + iv_0_low(32) + flash_addr(32) */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_IV0_HIGH_REG
 * @brief  Flash SEC Engine Cipher IV0 High Pattern Register (@ 0X084)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_IV_0_HIGH                    0
#define FLASH_SEC_MASK_IV_0_HIGH                     ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  IV 0 High Pattern value. IV is 16 bytes = iv_0_high(32) + iv_0_low(32) + flash_addr(32) + flash_addr_cnt(32) IV is 12 bytes = iv_0_high(32) + iv_0_low(32) + flash_addr(32) */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_IV1_LOW_REG
 * @brief  Flash SEC Engine Cipher IV1 Low Pattern Register (@ 0X088)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_IV_1_LOW                     0
#define FLASH_SEC_MASK_IV_1_LOW                      ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  IV 1 Low Pattern value. IV is 16 bytes = iv_1_high(32) + iv_1_low(32) + flash_addr(32) + flash_addr_cnt(32) IV is 12 bytes = iv_1_high(32) + iv_1_low(32) + flash_addr(32) */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_IV1_HIGH_REG
 * @brief  Flash SEC Engine Cipher IV1 High Pattern Register (@ 0X08C)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_IV_1_HIGH                    0
#define FLASH_SEC_MASK_IV_1_HIGH                     ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  IV 1 High Pattern value. IV is 16 bytes = iv_1_high(32) + iv_1_low(32) + flash_addr(32) + flash_addr_cnt(32) IV is 12 bytes = iv_1_high(32) + iv_1_low(32) + flash_addr(32) */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_IV2_LOW_REG
 * @brief  Flash SEC Engine Cipher IV2 Low Pattern Register (@ 0X090)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_IV_2_LOW                     0
#define FLASH_SEC_MASK_IV_2_LOW                      ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  IV 2 Low Pattern value. IV is 16 bytes = iv_2_high(32) + iv_2_low(32) + flash_addr(32) + flash_addr_cnt(32) IV is 12 bytes = iv_2_high(32) + iv_2_low(32) + flash_addr(32) */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_IV2_HIGH_REG
 * @brief  Flash SEC Engine Cipher IV2 High Pattern Register (@ 0X094)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_IV_2_HIGH                    0
#define FLASH_SEC_MASK_IV_2_HIGH                     ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  IV 2 High Pattern value. IV is 16 bytes = iv_2_high(32) + iv_2_low(32) + flash_addr(32) + flash_addr_cnt(32) IV is 12 bytes = iv_2_high(32) + iv_2_low(32) + flash_addr(32) */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_IV3_LOW_REG
 * @brief  Flash SEC Engine Cipher IV3 Low Pattern Register (@ 0X098)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_IV_3_LOW                     0
#define FLASH_SEC_MASK_IV_3_LOW                      ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  IV 3 Low Pattern value. IV is 16 bytes = iv_3_high(32) + iv_3_low(32) + flash_addr(32) + flash_addr_cnt(32) IV is 12 bytes = iv_3_high(32) + iv_3_low(32) + flash_addr(32) */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_IV3_HIGH_REG
 * @brief  Flash SEC Engine Cipher IV3 High Pattern Register (@ 0X09C)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_IV_3_HIGH                    0
#define FLASH_SEC_MASK_IV_3_HIGH                     ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  IV 3 High Pattern value. IV is 16 bytes = iv_3_high(32) + iv_3_low(32) + flash_addr(32) + flash_addr_cnt(32) IV is 12 bytes = iv_3_high(32) + iv_3_low(32) + flash_addr(32) */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_IV4_LOW_REG
 * @brief  Flash SEC Engine Cipher IV4 Low Pattern Register (@ 0X0A0)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_IV_4_LOW                     0
#define FLASH_SEC_MASK_IV_4_LOW                      ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  IV 4 Low Pattern value. IV is 16 bytes = iv_4_high(32) + iv_4_low(32) + flash_addr(32) + flash_addr_cnt(32) IV is 12 bytes = iv_4_high(32) + iv_4_low(32) + flash_addr(32) */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_IV4_HIGH_REG
 * @brief  Flash SEC Engine Cipher IV4 High Pattern Register (@ 0X0A4)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_IV_4_HIGH                    0
#define FLASH_SEC_MASK_IV_4_HIGH                     ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  IV 4 High Pattern value. IV is 16 bytes = iv_4_high(32) + iv_4_low(32) + flash_addr(32) + flash_addr_cnt(32) IV is 12 bytes = iv_4_high(32) + iv_4_low(32) + flash_addr(32) */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_IV5_LOW_REG
 * @brief  Flash SEC Engine Cipher IV5 Low Pattern Register (@ 0X0A8)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_IV_5_LOW                     0
#define FLASH_SEC_MASK_IV_5_LOW                      ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  IV 5 Low Pattern value. IV is 16 bytes = iv_5_high(32) + iv_5_low(32) + flash_addr(32) + flash_addr_cnt(32) IV is 12 bytes = iv_5_high(32) + iv_5_low(32) + flash_addr(32) */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_IV5_HIGH_REG
 * @brief  Flash SEC Engine Cipher IV5 High Pattern Register (@ 0X0AC)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_IV_5_HIGH                    0
#define FLASH_SEC_MASK_IV_5_HIGH                     ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  IV 5 High Pattern value. IV is 16 bytes = iv_5_high(32) + iv_5_low(32) + flash_addr(32) + flash_addr_cnt(32) IV is 12 bytes = iv_5_high(32) + iv_5_low(32) + flash_addr(32) */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_IV6_LOW_REG
 * @brief  Flash SEC Engine Cipher IV6 Low Pattern Register (@ 0X0B0)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_IV_6_LOW                     0
#define FLASH_SEC_MASK_IV_6_LOW                      ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  IV 6 Low Pattern value. IV is 16 bytes = iv_6_high(32) + iv_6_low(32) + flash_addr(32) + flash_addr_cnt(32) IV is 12 bytes = iv_6_high(32) + iv_6_low(32) + flash_addr(32) */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_IV6_HIGH_REG
 * @brief  Flash SEC Engine Cipher IV6 High Pattern Register (@ 0X0B4)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_IV_6_HIGH                    0
#define FLASH_SEC_MASK_IV_6_HIGH                     ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  IV 6 High Pattern value. IV is 16 bytes = iv_6_high(32) + iv_6_low(32) + flash_addr(32) + flash_addr_cnt(32) IV is 12 bytes = iv_6_high(32) + iv_6_low(32) + flash_addr(32) */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_IV7_LOW_REG
 * @brief  Flash SEC Engine Cipher IV7 Low Pattern Register (@ 0X0B8)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_IV_7_LOW                     0
#define FLASH_SEC_MASK_IV_7_LOW                      ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  IV 7 Low Pattern value. IV is 16 bytes = iv_7_high(32) + iv_7_low(32) + flash_addr(32) + flash_addr_cnt(32) IV is 12 bytes = iv_7_high(32) + iv_7_low(32) + flash_addr(32) */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_CIPHER_IV7_HIGH_REG
 * @brief  Flash SEC Engine Cipher IV7 High Pattern Register (@ 0X0BC)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_IV_7_HIGH                    0
#define FLASH_SEC_MASK_IV_7_HIGH                     ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0  IV 7 High Pattern value. IV is 16 bytes = iv_7_high(32) + iv_7_low(32) + flash_addr(32) + flash_addr_cnt(32) IV is 12 bytes = iv_7_high(32) + iv_7_low(32) + flash_addr(32) */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_REMAP0_ADDR_REG
 * @brief  Flash SEC Engine Remap Region0 Address Register (@ 0X100)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REMAP_BASE_0_ADDR            16
#define FLASH_SEC_MASK_REMAP_BASE_0_ADDR             ((u32)0x0000FFFF << 16)                             /*!<R/W 0  Remap region 0 base address[27:12]. Region Base Addr[31:0] = {flash_addr[31:28] + remap_base_addr + 12'b0}. The region address is 4KB aligned, and remap region size not cross 256MB. */
#define FLASH_SEC_SHIFT_REMAP_END_0_ADDR             0
#define FLASH_SEC_MASK_REMAP_END_0_ADDR              ((u32)0x0000FFFF << 0)                              /*!<R/W 0  Remap region 0 end address[27:12]. Region End Addr[31:0] = {flash_addr[31:28] + remap_end_addr + 12'b0}. The region address is 4KB aligned, and remap region size not cross 256MB. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_REMAP0_OFFSET_REG
 * @brief  Flash SEC Engine Remap Region0 Offset Register (@ 0X104)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REMAP_0_OFFSET               16
#define FLASH_SEC_MASK_REMAP_0_OFFSET                ((u32)0x0000FFFF << 16)                             /*!<R/W 0  Remap region 0 offset[27:12]. Region offset[31:0] = {4'b0 + remap_offset + 12'b0}. The output address is [Access address - region_base_addr + region_offset]. */
#define FLASH_SEC_SHIFT_REMAP_0_ENABLE               0
#define FLASH_SEC_BIT_REMAP_0_ENABLE                 ((u32)0x00000001 << 0)                              /*!<R/W 0  Remap region 0 enable. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_REMAP1_ADDR_REG
 * @brief  Flash SEC Engine Remap Region1 Address Register (@ 0X108)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REMAP_BASE_1_ADDR            16
#define FLASH_SEC_MASK_REMAP_BASE_1_ADDR             ((u32)0x0000FFFF << 16)                             /*!<R/W 0  Remap region 1 base address[27:12]. Region Base Addr[31:0] = {flash_addr[31:28] + remap_base_addr + 12'b0}. The region address is 4KB aligned, and remap region size not cross 256MB. */
#define FLASH_SEC_SHIFT_REMAP_END_1_ADDR             0
#define FLASH_SEC_MASK_REMAP_END_1_ADDR              ((u32)0x0000FFFF << 0)                              /*!<R/W 0  Remap region 1 end address[27:12]. Region End Addr[31:0] = {flash_addr[31:28] + remap_end_addr + 12'b0}. The region address is 4KB aligned, and remap region size not cross 256MB. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_REMAP1_OFFSET_REG
 * @brief  Flash SEC Engine Remap Region1 Offset Register (@ 0X10C)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REMAP_1_OFFSET               16
#define FLASH_SEC_MASK_REMAP_1_OFFSET                ((u32)0x0000FFFF << 16)                             /*!<R/W 0  Remap region 1 offset[27:12]. Region offset[31:0] = {4'b0 + remap_offset + 12'b0}. The output address is [Access address - region_base_addr + region_offset]. */
#define FLASH_SEC_SHIFT_REMAP_1_ENABLE               0
#define FLASH_SEC_BIT_REMAP_1_ENABLE                 ((u32)0x00000001 << 0)                              /*!<R/W 0  Remap region 1 enable. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_REMAP2_ADDR_REG
 * @brief  Flash SEC Engine Remap Region2 Address Register (@ 0X110)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REMAP_BASE_2_ADDR            16
#define FLASH_SEC_MASK_REMAP_BASE_2_ADDR             ((u32)0x0000FFFF << 16)                             /*!<R/W 0  Remap region 2 base address[27:12]. Region Base Addr[31:0] = {flash_addr[31:28] + remap_base_addr + 12'b0}. The region address is 4KB aligned, and remap region size not cross 256MB. */
#define FLASH_SEC_SHIFT_REMAP_END_2_ADDR             0
#define FLASH_SEC_MASK_REMAP_END_2_ADDR              ((u32)0x0000FFFF << 0)                              /*!<R/W 0  Remap region 2 end address[27:12]. Region End Addr[31:0] = {flash_addr[31:28] + remap_end_addr + 12'b0}. The region address is 4KB aligned, and remap region size not cross 256MB. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_REMAP2_OFFSET_REG
 * @brief  Flash SEC Engine Remap Region2 Offset Register (@ 0X114)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REMAP_2_OFFSET               16
#define FLASH_SEC_MASK_REMAP_2_OFFSET                ((u32)0x0000FFFF << 16)                             /*!<R/W 0  Remap region 2 offset[27:12]. Region offset[31:0] = {4'b0 + remap_offset + 12'b0}. The output address is [Access address - region_base_addr + region_offset]. */
#define FLASH_SEC_SHIFT_REMAP_2_ENABLE               0
#define FLASH_SEC_BIT_REMAP_2_ENABLE                 ((u32)0x00000001 << 0)                              /*!<R/W 0  Remap region 2 enable. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_REMAP3_ADDR_REG
 * @brief  Flash SEC Engine Remap Region3 Address Register (@ 0X118)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REMAP_BASE_3_ADDR            16
#define FLASH_SEC_MASK_REMAP_BASE_3_ADDR             ((u32)0x0000FFFF << 16)                             /*!<R/W 0  Remap region 3 base address[27:12]. Region Base Addr[31:0] = {flash_addr[31:28] + remap_base_addr + 12'b0}. The region address is 4KB aligned, and remap region size not cross 256MB. */
#define FLASH_SEC_SHIFT_REMAP_END_3_ADDR             0
#define FLASH_SEC_MASK_REMAP_END_3_ADDR              ((u32)0x0000FFFF << 0)                              /*!<R/W 0  Remap region 3 end address[27:12]. Region End Addr[31:0] = {flash_addr[31:28] + remap_end_addr + 12'b0}. The region address is 4KB aligned, and remap region size not cross 256MB. */
/** @} */

/**************************************************************************//**
 * @defgroup FLASH_SEC_SEC_REMAP3_OFFSET_REG
 * @brief  Flash SEC Engine Remap Region3 Offset Register (@ 0X11C)
 * @{
 *****************************************************************************/
#define FLASH_SEC_SHIFT_REMAP_3_OFFSET               16
#define FLASH_SEC_MASK_REMAP_3_OFFSET                ((u32)0x0000FFFF << 16)                             /*!<R/W 0  Remap region 3 offset[27:12]. Region offset[31:0] = {4'b0 + remap_offset + 12'b0}. The output address is [Access address - region_base_addr + region_offset]. */
#define FLASH_SEC_SHIFT_REMAP_3_ENABLE               0
#define FLASH_SEC_BIT_REMAP_3_ENABLE                 ((u32)0x00000001 << 0)                              /*!<R/W 0  Remap region 3 enable. */
/** @} */

