Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_flash_sec_type.h
/**************************************************************************//**
 * @defgroup rtl8735b_FLASH_SEC
 * @{
 * @brief rtl8735b_FLASH_SEC Register Declaration
 *****************************************************************************/
typedef struct {
	__I  uint32_t FLASH_SEC_SEC_STS_REG ;                  /*!<  Flash SEC Engine Status Register register,  Address offset: 0x000 */
	__I  uint32_t FLASH_SEC_SEC_CID_REG ;                  /*!<  Flash SEC Engine Component Identification Register register,  Address offset: 0x004 */
	__I  uint32_t FLASH_SEC_SEC_ERR_ADDR_REG ;             /*!<  Flash SEC Engine Error Address Log Register register,  Address offset: 0x008 */
	__O  uint32_t FLASH_SEC_SEC_RESV0_REG ;                /*!<  Flash SEC Engine Reserved 0 Register register,  Address offset: 0x00C */
	__O  uint32_t FLASH_SEC_SEC_CLR_INT_REG ;              /*!<  Flash SEC Engine Clear Interrupt Register register,  Address offset: 0x010 */
	__IO uint32_t FLASH_SEC_SEC_CTRL_REG ;                 /*!<  Flash SEC Engine Control Register register,  Address offset: 0x014 */
	__O  uint32_t FLASH_SEC_SEC_MAINTAIN_OP_REG ;          /*!<  Flash SEC Engine Maintenance Operation Register register,  Address offset: 0x018 */
	__IO uint32_t FLASH_SEC_SEC_LOCK_CTRL_REG ;            /*!<  Flash SEC Engine Write Lock Control Register register,  Address offset: 0x01C */
	__IO uint32_t FLASH_SEC_SEC_GCM_TAG_BASE_REG ;         /*!<  Flash SEC Engine AES GCM TAG Base Address Register register,  Address offset: 0x020 */
	__IO uint32_t RSVD0[7];                                /*!<  Reserved,  Address offset:0x24-0x3C */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_REGION0_BASE_REG ;  /*!<  Flash SEC Engine Cipher Region0 Base Address Register register,  Address offset: 0x040 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_REGION0_END_REG ;   /*!<  Flash SEC Engine Cipher Region0 End Address Register register,  Address offset: 0x044 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_REGION1_BASE_REG ;  /*!<  Flash SEC Engine Cipher Region1 Base Address Register register,  Address offset: 0x048 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_REGION1_END_REG ;   /*!<  Flash SEC Engine Cipher Region1 End Address Register register,  Address offset: 0x04C */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_REGION2_BASE_REG ;  /*!<  Flash SEC Engine Cipher Region2 Base Address Register register,  Address offset: 0x050 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_REGION2_END_REG ;   /*!<  Flash SEC Engine Cipher Region2 End Address Register register,  Address offset: 0x054 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_REGION3_BASE_REG ;  /*!<  Flash SEC Engine Cipher Region3 Base Address Register register,  Address offset: 0x058 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_REGION3_END_REG ;   /*!<  Flash SEC Engine Cipher Region3 End Address Register register,  Address offset: 0x05C */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_REGION4_BASE_REG ;  /*!<  Flash SEC Engine Cipher Region4 Base Address Register register,  Address offset: 0x060 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_REGION4_END_REG ;   /*!<  Flash SEC Engine Cipher Region4 End Address Register register,  Address offset: 0x064 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_REGION5_BASE_REG ;  /*!<  Flash SEC Engine Cipher Region5 Base Address Register register,  Address offset: 0x068 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_REGION5_END_REG ;   /*!<  Flash SEC Engine Cipher Region5 End Address Register register,  Address offset: 0x06C */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_REGION6_BASE_REG ;  /*!<  Flash SEC Engine Cipher Region6 Base Address Register register,  Address offset: 0x070 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_REGION6_END_REG ;   /*!<  Flash SEC Engine Cipher Region6 End Address Register register,  Address offset: 0x074 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_REGION7_BASE_REG ;  /*!<  Flash SEC Engine Cipher Region7 Base Address Register register,  Address offset: 0x078 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_REGION7_END_REG ;   /*!<  Flash SEC Engine Cipher Region7 End Address Register register,  Address offset: 0x07C */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_IV0_LOW_REG ;       /*!<  Flash SEC Engine Cipher IV0 Low Pattern Register register,  Address offset: 0x080 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_IV0_HIGH_REG ;      /*!<  Flash SEC Engine Cipher IV0 High Pattern Register register,  Address offset: 0x084 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_IV1_LOW_REG ;       /*!<  Flash SEC Engine Cipher IV1 Low Pattern Register register,  Address offset: 0x088 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_IV1_HIGH_REG ;      /*!<  Flash SEC Engine Cipher IV1 High Pattern Register register,  Address offset: 0x08C */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_IV2_LOW_REG ;       /*!<  Flash SEC Engine Cipher IV2 Low Pattern Register register,  Address offset: 0x090 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_IV2_HIGH_REG ;      /*!<  Flash SEC Engine Cipher IV2 High Pattern Register register,  Address offset: 0x094 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_IV3_LOW_REG ;       /*!<  Flash SEC Engine Cipher IV3 Low Pattern Register register,  Address offset: 0x098 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_IV3_HIGH_REG ;      /*!<  Flash SEC Engine Cipher IV3 High Pattern Register register,  Address offset: 0x09C */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_IV4_LOW_REG ;       /*!<  Flash SEC Engine Cipher IV4 Low Pattern Register register,  Address offset: 0x0A0 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_IV4_HIGH_REG ;      /*!<  Flash SEC Engine Cipher IV4 High Pattern Register register,  Address offset: 0x0A4 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_IV5_LOW_REG ;       /*!<  Flash SEC Engine Cipher IV5 Low Pattern Register register,  Address offset: 0x0A8 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_IV5_HIGH_REG ;      /*!<  Flash SEC Engine Cipher IV5 High Pattern Register register,  Address offset: 0x0AC */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_IV6_LOW_REG ;       /*!<  Flash SEC Engine Cipher IV6 Low Pattern Register register,  Address offset: 0x0B0 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_IV6_HIGH_REG ;      /*!<  Flash SEC Engine Cipher IV6 High Pattern Register register,  Address offset: 0x0B4 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_IV7_LOW_REG ;       /*!<  Flash SEC Engine Cipher IV7 Low Pattern Register register,  Address offset: 0x0B8 */
	__IO uint32_t FLASH_SEC_SEC_CIPHER_IV7_HIGH_REG ;      /*!<  Flash SEC Engine Cipher IV7 High Pattern Register register,  Address offset: 0x0BC */
	__IO uint32_t RSVD1[16];                               /*!<  Reserved,  Address offset:0xC0-0xFC */
	__IO uint32_t FLASH_SEC_SEC_REMAP0_ADDR_REG ;          /*!<  Flash SEC Engine Remap Region0 Address Register register,  Address offset: 0x100 */
	__IO uint32_t FLASH_SEC_SEC_REMAP0_OFFSET_REG ;        /*!<  Flash SEC Engine Remap Region0 Offset Register register,  Address offset: 0x104 */
	__IO uint32_t FLASH_SEC_SEC_REMAP1_ADDR_REG ;          /*!<  Flash SEC Engine Remap Region1 Address Register register,  Address offset: 0x108 */
	__IO uint32_t FLASH_SEC_SEC_REMAP1_OFFSET_REG ;        /*!<  Flash SEC Engine Remap Region1 Offset Register register,  Address offset: 0x10C */
	__IO uint32_t FLASH_SEC_SEC_REMAP2_ADDR_REG ;          /*!<  Flash SEC Engine Remap Region2 Address Register register,  Address offset: 0x110 */
	__IO uint32_t FLASH_SEC_SEC_REMAP2_OFFSET_REG ;        /*!<  Flash SEC Engine Remap Region2 Offset Register register,  Address offset: 0x114 */
	__IO uint32_t FLASH_SEC_SEC_REMAP3_ADDR_REG ;          /*!<  Flash SEC Engine Remap Region3 Address Register register,  Address offset: 0x118 */
	__IO uint32_t FLASH_SEC_SEC_REMAP3_OFFSET_REG ;        /*!<  Flash SEC Engine Remap Region3 Offset Register register,            Address offset: 0x11C */
} FLASH_SEC_TypeDef;
/** @} */

#endif
